package org.itstep.lesson10.homework;

public class Task1 {
    //Напишіть програму, яка перевіряє, чи є один рядок анаграмою
    //для іншого рядка (рядок може складатися з кількох слів і
    //символів пунктуації). Ігноруйте пробіли і пунктуацію під час
    //аналізу. Різниця у великих і маленьких літерах має ігноруватися.
    //Обидва рядка мають вводитися з клавіатури. Програма має
    //виводити Yes, якщо рядки є анаграмою, і No — якщо навпаки.
    //Приклад анаграми у віршах:
    //Рядок 1 “Я не лев!” – левеня;
    //Рядок 2 “Я не лис!” – лисеня.
}
