package org.itstep.lesson13.homework;

public class Task3 {
    ////Завдання 8
    //    //Заповніть n-мірний квадратний масив числами, які
    //    //збільшуються на 1 по спіралі (число n задається з клавіатури).
    //    //Виведіть результат на екран дотримуючись ширини стовпців.
    //    //Наприклад, масив 4х4 має відповідати прикладу, зображеному
    //    //нижче.
    //    //ДОМАШНЄ ЗАВДАННЯ
    //    //3
    //    //Приклад:
    //    //1 2 3 4
    //    //12 13 14 5
    //    //11 16 15 6
    //    //10 9 8 7
    //    //Додатково: за виконання завдання з використанням тільки
    //    //одного циклу +1 бал.
}
