package org.itstep.lesson13.homework;

public class Task1 {
    //Завдання 6
    //Створіть квадратний масив розмірності n заповнений
    //випадковими числами. Виведіть масив на екран у вигляді
    //таблиці. Знайдіть найменший і найбільший елементи масивуі
    //виведіть їх на екран (якщо знайдено кілька однаковихелементів
    //— виведіть індекси рядка та стовпця, де є повторення). Виведіть
    //на екран час виконання пошуку в мілісекундах. Розмірність
    //масиву має задаватися з клавіатури.


}
