package org.itstep.lesson17.practik;

public class DeviceMain {
 //  Завдання 1: Створіть базовий клас «Пристрій» та похідні класи: «Чайник»,
    //  «Мікрохвильовка», «Автомобіль», «Пароплав». За допомогою конструктора,
    //  дайте назву кожному пристрою і його характеристики.
    //  Реалізуйте для кожного з класів методи:
    //   Sound — видає звук пристрою (пишемо текстом у консоль).
    //   Show — відображає назву пристрою.
    //   Desc — відображає опис пристрою.
 public static void main(String[] args) {
   // Device device = new Microwave("Samsung");
 }

}
